Revit 2024 API
FlexDuct.Create Method (Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>)
 Creates a new flexible duct into the document, using a point array and flexible duct type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static FlexDuct Create(
	Document document,
	ElementId systemTypeId,
	ElementId ductTypeId,
	ElementId levelId,
	XYZ startTangent,
	XYZ endTangent,
	IList<XYZ> points
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	systemTypeId As ElementId, _
	ductTypeId As ElementId, _
	levelId As ElementId, _
	startTangent As XYZ, _
	endTangent As XYZ, _
	points As IList(Of XYZ) _
) As FlexDuct
Visual C++
public:
static FlexDuct^ Create(
	Document^ document,
	ElementId^ systemTypeId,
	ElementId^ ductTypeId,
	ElementId^ levelId,
	XYZ^ startTangent,
	XYZ^ endTangent,
	IList<XYZ^>^ points
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
systemTypeId
Type: Autodesk.Revit.DB.ElementId
 The id of the HVAC system type.
ductTypeId
Type: Autodesk.Revit.DB.ElementId
 The id of the flexible duct.
levelId
Type: Autodesk.Revit.DB.ElementId
 The level id for the flexible duct.
startTangent
Type: Autodesk.Revit.DB.XYZ
 The tangent vector at the start of the curve. The invalid or zero vector is ignored.
endTangent
Type: Autodesk.Revit.DB.XYZ
 The tangent vector at the end of the curve. The invalid or zero vector is ignored.
points
Type: System.Collections.Generic.IList<XYZ>
 The point array indicating the path of the flexible duct, including the end point.
Return Value
 If creation was successful then a new flexible duct is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The systemTypeId is not valid HVAC system type. -or- The type ductTypeId is not valid flexible duct type. -or- The ElementId levelId is not a Level. -or- The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
FlexDuct Class
Create Overload
Autodesk.Revit.DB.Mechanical Namespace